Внимание! Задания практикума нужно будет выполнить в паре.

Вы вдвоем со своим коллегой работаете над корпоративным сайтом. 

Итак, вам необходимо выполнить ряд действий:

Выберите себе в напарники коллегу по курсу.
Создайте репозиторий sf_site.
Создайте свою ветку от ветки master.
Создайте в ней несколько файлов.
Залейте изменения в удаленный репозиторий.
Попросите коллегу сделать тоже самое: создать свою ветку со своими файлами.
Переключитесь на ветку коллеги.
Внесите изменения в файлы коллеги.
Создайте пулл-реквест в ветку master.
Тем временем коллега также переключается в вашу ветку и вносит свои правки, создает пулл-реквест.
Добавьте комментарии к строкам кода в созданные пулл-реквесты.
Каждый заливает свой пулл-реквест в ветку master.
После того как вы и ваш коллега влили свои пулл-реквесты, актуализируйте ветку master на своем локальном репозитории.
Ссылку на созданный репозиторий отправьте своему ментору.